Reports/СверкаАнкетныхДанныхКлиентовСДаннымиГруппыКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>СверкаАнкетныхДанныхКлиентовСДаннымиГруппыКомпаний</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАнкеты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СверкаАнкетныхДанныхКлиентовСДаннымиГруппыКомпаний/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;		
	
	НастройкиКД = ЭтотОбъект.КомпоновщикНастроек.Настройки;	
	
	// Фиксируем запуск процедуры
	ОтключитьСборСтатистики = Ложь;
	НастройкиКД.ДополнительныеСвойства.Свойство("ОтключитьСборСтатистики", ОтключитьСборСтатистики); 
	Если ОтключитьСборСтатистики <> Истина Тогда
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюКомпоновкиСКД(ЭтотОбъект);
	КонецЕсли;
		
	// Заполняем параметры СКД
	ПараметрыДанных = НастройкиКД.ПараметрыДанных;
	
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаАнкеты) Тогда	
		ПараметрыДанных.УстановитьЗначениеПараметра("ДатаАнкеты", ЭтотОбъект.ДатаАнкеты);
	Иначе
		ПараметрыДанных.Элементы.Найти("ДатаАнкеты").Использование = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Клиент) Тогда	
		ПараметрыДанных.УстановитьЗначениеПараметра("Клиент", ЭтотОбъект.Клиент);
	Иначе
		ПараметрыДанных.Элементы.Найти("Клиент").Использование = Ложь;
	КонецЕсли;
	
	// Формируем текст запроса	
	ТипНеограниченнаяСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(0));
	
	// Анкеты юридических лиц
	ТекстЗапросаРеквизитовЮрЛиц			= "";
	ТекстЗапросаЗначенияРеквизитаЮрЛиц	= "";
	
	МетаРесурсыАнкеты	= Метаданные.РегистрыСведений.РеквизитыЮридическихЛицАнкетные.Ресурсы;
	МетаРесурсыГК		= Метаданные.РегистрыСведений.РеквизитыЮридическихЛиц.Ресурсы;
	
	Для Каждого МетаРесурс Из МетаРесурсыАнкеты Цикл
		// Сравниваем только одноименные реквизиты
		Если МетаРесурсыГК.Найти(МетаРесурс.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекстЗапросаРеквизитовЮрЛиц) Тогда
			ТекстЗапросаРеквизитовЮрЛиц = "
				|""" + МетаРесурс.Имя + """ КАК Имя, """ + МетаРесурс.Синоним + """ КАК Синоним
				|ПОМЕСТИТЬ _РеквизитыЮрЛиц";
		Иначе
			ТекстЗапросаРеквизитовЮрЛиц = ТекстЗапросаРеквизитовЮрЛиц + "
               |ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + МетаРесурс.Имя + """, """ + МетаРесурс.Синоним + """";	
		КонецЕсли;
		
		// Для строк неограниченной длины установим длину в 1024 символа
		Если МетаРесурс.Тип = ТипНеограниченнаяСтрока Тогда
			ТекстЗапросаЗначенияРеквизитаЮрЛиц = ТекстЗапросаЗначенияРеквизитаЮрЛиц + "
				|КОГДА _Реквизиты.Имя = """ + МетаРесурс.Имя + """ ТОГДА ВЫРАЗИТЬ(Реквизиты." + МетаРесурс.Имя + " КАК СТРОКА(1024))";
		Иначе
			ТекстЗапросаЗначенияРеквизитаЮрЛиц = ТекстЗапросаЗначенияРеквизитаЮрЛиц + "
				|КОГДА _Реквизиты.Имя = """ + МетаРесурс.Имя + """ ТОГДА Реквизиты." + МетаРесурс.Имя;
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапросаЗначенияРеквизитаЮрЛиц = "
		|ВЫБОР" + ТекстЗапросаЗначенияРеквизитаЮрЛиц + "
		|КОНЕЦ";
	
	// Основной запрос
	ТекстЗапроса = "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ &ТекстЗапросаРеквизитовЮрЛиц;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыАнкетыТранспонированные.Регистратор КАК Регистратор,
		|	РеквизитыАнкетыТранспонированные.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыАнкетыТранспонированные.Реквизит КАК Реквизит,
		|	РеквизитыАнкетыТранспонированные.ПредставлениеРеквизита КАК ПредставлениеРеквизита,
		|	РеквизитыАнкетыТранспонированные.Значение КАК ЗначениеАнкеты, 
		|	ЕСТЬNULL(РеквизитыГКТранспонированные.Значение, ""<Не зарегистрировано>"") КАК ЗначениеГК
		|ИЗ
		|	(ВЫБРАТЬ
		|		Реквизиты.Регистратор КАК Регистратор,
		|		Реквизиты.ЮрФизЛицо КАК ЮрФизЛицо,
		|		_Реквизиты.Имя КАК Реквизит,
		|		_Реквизиты.Синоним КАК ПредставлениеРеквизита,
		|		&ТекстЗапросаЗначенияРеквизитаЮрЛиц КАК Значение
		|	ИЗ
		|		РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				{&ДатаАнкеты},
		|				Организация В (&Организация)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					{ЮрФизЛицо = &Клиент}) КАК Реквизиты,
		|		_РеквизитыЮрЛиц КАК _Реквизиты) КАК РеквизитыАнкетыТранспонированные
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Реквизиты.ЮрФизЛицо КАК ЮрФизЛицо,
		|			_Реквизиты.Имя КАК Реквизит,
		|			&ТекстЗапросаЗначенияРеквизитаЮрЛиц КАК Значение
		|		ИЗ
		|			РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					{&ДатаАнкеты},
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						{ЮрФизЛицо = &Клиент}) КАК Реквизиты,
		|			_РеквизитыЮрЛиц КАК _Реквизиты) КАК РеквизитыГКТранспонированные
		|		ПО РеквизитыАнкетыТранспонированные.ЮрФизЛицо = РеквизитыГКТранспонированные.ЮрФизЛицо
		|			И РеквизитыАнкетыТранспонированные.Реквизит = РеквизитыГКТранспонированные.Реквизит
		|ГДЕ
		|	РеквизитыГКТранспонированные.Значение ЕСТЬ NULL
		|	ИЛИ РеквизитыАнкетыТранспонированные.Значение <> РеквизитыГКТранспонированные.Значение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРеквизитовЮрЛиц", ТекстЗапросаРеквизитовЮрЛиц);	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаЗначенияРеквизитаЮрЛиц", ТекстЗапросаЗначенияРеквизитаЮрЛиц);
	
	// Подменяем исходный запрос
	ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
	
	// Ручная компоновка отчета для определения, есть ли в отчете данные или он пустой.
	РезультатПроверки = Ложь;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки, Истина);
		
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Выводим данные
	ПроцессорВывода.НачатьВывод();
	Пока Истина Цикл
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если Не РезультатПроверки Тогда
			Если ЭлементРезультата.ЗначенияПараметров.Количество() Тогда
				РезультатПроверки = Истина;
			КонецЕсли;				
		КонецЕсли;
		
	    ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
	// Фиксируем результат формирования отчета  
	НастройкиКД.ДополнительныеСвойства.Вставить("ОтчетСодержитДанные", РезультатПроверки);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Ложь);
	
	// Фиксируем завершение процедуры
	Если ОтключитьСборСтатистики <> Истина Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессииКомпоновкиСКД(ЭтотОбъект, Сессия);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьРазличия(ДанныеАнкеты) Экспорт
	ТаблицаРазличий = Новый ТаблицаЗначений;
	ТаблицаРазличий.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка"));
	ТаблицаРазличий.Колонки.Добавить("ПредставлениеРеквизита", Новый ОписаниеТипов("Строка"));
	ТаблицаРазличий.Колонки.Добавить("ЗначениеАнкеты");
	ТаблицаРазличий.Колонки.Добавить("ЗначениеГК");
	
	СверяемоеЛицо	= ДанныеАнкеты.ЮрФизЛицо;
	ДатаАнкеты		= ДанныеАнкеты.Дата;
	ДанныеГК		= Неопределено;	
	
	Если Не ЗначениеЗаполнено(СверяемоеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано сверяемое юр. / физ. лицо", ДанныеАнкеты, "Объект.ЮрФизЛицо");
		Возврат Неопределено;		
	КонецЕсли;
	
	// Анкеты юридических лиц
	Если СверяемоеЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		ИмяТаблицыРеквизитов = "РеквизитыЮридическихЛиц";
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Физические лица больше не принимаются к сверке");
		Возврат Неопределено;
	КонецЕсли;
	
	// Получаем данные ГК
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|		&ДатаАнкеты,
		|		Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|		И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|		И ЮрФизЛицо = &ЮрФизЛицо) КАК Реквизиты
		|");
	Запрос.УстановитьПараметр("ЮрФизЛицо", СверяемоеЛицо);
	Запрос.УстановитьПараметр("ДатаАнкеты", ДатаАнкеты);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеквизитыЮридическихЛиц", ИмяТаблицыРеквизитов);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ДанныеГК = РезультатЗапроса.Выгрузить()[0];
	КонецЕсли;
	
	// Ищем различия в данных
	МетаРесурсыАнкеты	= Метаданные.РегистрыСведений[ИмяТаблицыРеквизитов + "Анкетные"].Ресурсы;
	МетаРесурсыГК		= Метаданные.РегистрыСведений[ИмяТаблицыРеквизитов].Ресурсы;
	
	Для Каждого МетаРесурс Из МетаРесурсыАнкеты Цикл
		// Сравниваем только одноименные реквизиты
		Если МетаРесурс.Имя = "КПП" И ДанныеГК <> Неопределено И ЗначениеЗаполнено(ДанныеГК.КПП2) Тогда
			РесурсГК = "КПП2";
		ИначеЕсли МетаРесурс.Имя = "КППКрупнейшегоНалогоплательщика" И ДанныеГК <> Неопределено И ЗначениеЗаполнено(ДанныеГК.КПП2)  Тогда
			РесурсГК = "КПП";
		ИначеЕсли МетаРесурсыГК.Найти(МетаРесурс.Имя) = Неопределено Тогда
			Продолжить;
		Иначе
			РесурсГК = МетаРесурс.Имя;
		КонецЕсли;
		
		ЗначениеГК = ?(ДанныеГК = Неопределено, Неопределено, ДанныеГК[РесурсГК]);
		
		Если РесурсГК = "СерияУдостоверенияЛичности"
		 ИЛИ РесурсГК = "НомерУдостоверенияЛичности" Тогда
			ЗначениеГК = СтрЗаменить(ЗначениеГК, " ", "");
		КонецЕсли;
		
		Если ДанныеАнкеты[МетаРесурс.Имя] <> ЗначениеГК Тогда
			СтрокаРазличия = ТаблицаРазличий.Добавить();
			СтрокаРазличия.Реквизит					= МетаРесурс.Имя;
			СтрокаРазличия.ПредставлениеРеквизита	= МетаРесурс.Синоним;
			СтрокаРазличия.ЗначениеАнкеты			= ДанныеАнкеты[МетаРесурс.Имя];
			СтрокаРазличия.ЗначениеГК				= ЗначениеГК;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат ТаблицаРазличий;
КонецФункции
